; ModuleID = 'source.spice'
source_filename = "source.spice"

%struct.Vector = type { %interface.IIterable, ptr, i64, i64 }
%interface.IIterable = type { ptr }
%struct.VectorIterator = type { %interface.IIterator, ptr, i64 }
%interface.IIterator = type { ptr }
%struct.Pair = type { i64, ptr }

@anon.string.0 = private unnamed_addr constant [68 x i8] c"Assertion failed: Condition 'vi.getSize() == 3' evaluated to false.\00", align 1
@anon.string.1 = private unnamed_addr constant [63 x i8] c"Assertion failed: Condition 'it.isValid()' evaluated to false.\00", align 1
@anon.string.2 = private unnamed_addr constant [66 x i8] c"Assertion failed: Condition 'it.get() == 123' evaluated to false.\00", align 1
@anon.string.3 = private unnamed_addr constant [66 x i8] c"Assertion failed: Condition 'it.get() == 123' evaluated to false.\00", align 1
@anon.string.4 = private unnamed_addr constant [67 x i8] c"Assertion failed: Condition 'it.get() == 4321' evaluated to false.\00", align 1
@anon.string.5 = private unnamed_addr constant [63 x i8] c"Assertion failed: Condition 'it.isValid()' evaluated to false.\00", align 1
@anon.string.6 = private unnamed_addr constant [71 x i8] c"Assertion failed: Condition 'pair.getFirst() == 2' evaluated to false.\00", align 1
@anon.string.7 = private unnamed_addr constant [75 x i8] c"Assertion failed: Condition 'pair.getSecond() == 9876' evaluated to false.\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "printf.str.0", linkageName: "printf.str.0", scope: !2, file: !5, line: 68, type: !6, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "spice version dev (https://github.com/spicelang/spice)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/marc/Dokumente/Dev/spice/cmake-build-debug/test/./test-files/irgenerator/debug-info/success-dbg-info-complex/source.spice", directory: "./test-files/irgenerator/debug-info/success-dbg-info-complex")
!4 = !{!0}
!5 = !DIFile(filename: "source.spice", directory: "./test-files/irgenerator/debug-info/success-dbg-info-complex")
!6 = !DIStringType(name: "printf.str.0", size: 192)
!7 = !{i32 7, !"Dwarf Version", i32 4}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{i32 1, !"wchar_size", i32 4}
!10 = !{i32 8, !"PIC Level", i32 2}
!11 = !{i32 7, !"PIE Level", i32 2}
!12 = !{i32 7, !"uwtable", i32 2}
!13 = !{i32 7, !"frame-pointer", i32 2}
!14 = !{!"spice version dev (https://github.com/spicelang/spice)"}
!15 = distinct !DISubprogram(name: "main", linkageName: "_Z4mainiPPKc", scope: !5, file: !5, line: 4, type: !16, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !22)
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !18, !19}
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, elements: !22)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!22 = !{}
!23 = !DILocalVariable(name: "result", scope: !15, file: !5, line: 4, type: !18)
!24 = !DILocation(line: 4, column: 1, scope: !15)
!25 = !DILocalVariable(name: "_argc", arg: 1, scope: !15, file: !5, line: 4, type: !18)
!26 = !DILocalVariable(name: "_argv", arg: 2, scope: !15, file: !5, line: 4, type: !19)
!27 = !DILocalVariable(name: "vi", scope: !15, file: !5, line: 6, type: !28)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vector", scope: !5, file: !5, line: 25, size: 256, align: 8, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !29, identifier: "struct.Vector")
!29 = !{!30, !32, !34}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !28, file: !5, line: 26, baseType: !31, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !28, file: !5, line: 27, baseType: !33, size: 64, offset: 128)
!33 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !28, file: !5, line: 28, baseType: !33, size: 64, offset: 192)
!35 = !DILocation(line: 6, column: 5, scope: !15)
!36 = !DILocation(line: 6, column: 22, scope: !15)
!37 = !DILocation(line: 7, column: 17, scope: !15)
!38 = !DILocation(line: 8, column: 17, scope: !15)
!39 = !DILocation(line: 9, column: 17, scope: !15)
!40 = !DILocation(line: 10, column: 12, scope: !15)
!41 = !DILocation(line: 10, column: 28, scope: !15)
!42 = !{!"branch_weights", i32 2000, i32 1}
!43 = !DILocation(line: 13, column: 14, scope: !15)
!44 = !DILocalVariable(name: "it", scope: !15, file: !5, line: 13, type: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "VectorIterator", scope: !5, file: !5, line: 253, size: 192, align: 8, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !46, identifier: "struct.VectorIterator")
!46 = !{!47, !54}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !45, file: !5, line: 254, baseType: !48, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vector", scope: !5, file: !5, line: 25, size: 256, align: 8, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !50, identifier: "struct.Vector")
!50 = !{!51, !52, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !49, file: !5, line: 26, baseType: !31, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !49, file: !5, line: 27, baseType: !33, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !49, file: !5, line: 28, baseType: !33, size: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !45, file: !5, line: 255, baseType: !33, size: 64, offset: 128)
!55 = !DILocation(line: 13, column: 5, scope: !15)
!56 = !DILocation(line: 14, column: 12, scope: !15)
!57 = !DILocation(line: 15, column: 12, scope: !15)
!58 = !DILocation(line: 15, column: 24, scope: !15)
!59 = !DILocation(line: 16, column: 12, scope: !15)
!60 = !DILocation(line: 16, column: 24, scope: !15)
!61 = !DILocation(line: 17, column: 5, scope: !15)
!62 = !DILocation(line: 18, column: 12, scope: !15)
!63 = !DILocation(line: 18, column: 24, scope: !15)
!64 = !DILocation(line: 19, column: 12, scope: !15)
!65 = !DILocation(line: 20, column: 5, scope: !15)
!66 = !DILocation(line: 21, column: 16, scope: !15)
!67 = !DILocalVariable(name: "pair", scope: !15, file: !5, line: 21, type: !68)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pair", scope: !5, file: !5, line: 8, size: 128, align: 8, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !69, identifier: "struct.Pair")
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !68, file: !5, line: 9, baseType: !33, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !68, file: !5, line: 10, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !18, size: 64)
!73 = !DILocation(line: 21, column: 5, scope: !15)
!74 = !DILocation(line: 22, column: 12, scope: !15)
!75 = !DILocation(line: 22, column: 31, scope: !15)
!76 = !DILocation(line: 23, column: 12, scope: !15)
!77 = !DILocation(line: 23, column: 32, scope: !15)
!78 = !DILocation(line: 24, column: 5, scope: !15)
!79 = !DILocation(line: 25, column: 13, scope: !15)
!80 = !DILocation(line: 28, column: 17, scope: !15)
!81 = !DILocation(line: 29, column: 17, scope: !15)
!82 = !DILocation(line: 30, column: 12, scope: !15)
!83 = !DILocation(line: 33, column: 5, scope: !15)
!84 = !DILocation(line: 34, column: 12, scope: !15)
!85 = !DILocation(line: 34, column: 24, scope: !15)
!86 = !DILocation(line: 35, column: 12, scope: !15)
!87 = !DILocation(line: 36, column: 5, scope: !15)
!88 = !DILocation(line: 37, column: 12, scope: !15)
!89 = !DILocation(line: 37, column: 24, scope: !15)
!90 = !DILocation(line: 38, column: 5, scope: !15)
!91 = !DILocation(line: 39, column: 12, scope: !15)
!92 = !DILocation(line: 39, column: 24, scope: !15)
!93 = !DILocation(line: 40, column: 5, scope: !15)
!94 = !DILocation(line: 41, column: 12, scope: !15)
!95 = !DILocation(line: 41, column: 24, scope: !15)
!96 = !DILocation(line: 42, column: 5, scope: !15)
!97 = !DILocation(line: 43, column: 13, scope: !15)
!98 = !DILocation(line: 46, column: 24, scope: !99)
!99 = distinct !DILexicalBlock(scope: !15, file: !5, line: 46, column: 5)
!100 = !DILocalVariable(name: "item", scope: !99, file: !5, line: 46, type: !18)
!101 = !DILocation(line: 46, column: 13, scope: !99)
!102 = !DILocation(line: 47, column: 9, scope: !99)
!103 = !DILocation(line: 49, column: 19, scope: !15)
!104 = !DILocation(line: 49, column: 25, scope: !15)
!105 = !DILocation(line: 50, column: 19, scope: !15)
!106 = !DILocation(line: 50, column: 25, scope: !15)
!107 = !DILocation(line: 51, column: 19, scope: !15)
!108 = !DILocation(line: 51, column: 25, scope: !15)
!109 = !DILocation(line: 54, column: 25, scope: !110)
!110 = distinct !DILexicalBlock(scope: !15, file: !5, line: 54, column: 5)
!111 = !DILocalVariable(name: "item", scope: !110, file: !5, line: 54, type: !72)
!112 = !DILocation(line: 54, column: 13, scope: !110)
!113 = !DILocation(line: 55, column: 9, scope: !110)
!114 = !DILocation(line: 57, column: 19, scope: !15)
!115 = !DILocation(line: 57, column: 25, scope: !15)
!116 = !DILocation(line: 58, column: 19, scope: !15)
!117 = !DILocation(line: 58, column: 25, scope: !15)
!118 = !DILocation(line: 59, column: 19, scope: !15)
!119 = !DILocation(line: 59, column: 25, scope: !15)
!120 = !DILocation(line: 61, column: 35, scope: !121)
!121 = distinct !DILexicalBlock(scope: !15, file: !5, line: 61, column: 5)
!122 = !DILocalVariable(name: "idx", scope: !121, file: !5, line: 61, type: !123)
!123 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!124 = !DILocation(line: 61, column: 13, scope: !121)
!125 = !DILocalVariable(name: "item", scope: !121, file: !5, line: 61, type: !72)
!126 = !DILocation(line: 61, column: 23, scope: !121)
!127 = !DILocation(line: 62, column: 9, scope: !121)
!128 = !DILocation(line: 64, column: 19, scope: !15)
!129 = !DILocation(line: 64, column: 25, scope: !15)
!130 = !DILocation(line: 65, column: 19, scope: !15)
!131 = !DILocation(line: 65, column: 25, scope: !15)
!132 = !DILocation(line: 66, column: 19, scope: !15)
!133 = !DILocation(line: 66, column: 25, scope: !15)
!134 = !DILocation(line: 68, column: 5, scope: !15)
